#+title: Como fazer um videojogo (simples) em Godot
#+PROPERTY: header-args :results drawer

* Sessão: Como fazer um videojogo (simples) em Godot

Orador: Rafael Gonçalves

- Assets
  #+begin_src bash
  cd ~/repos && git clone https://github.com/gonzelvis/sapador
  #+end_src

  #+RESULTS:
  :results:
  fatal: destination path 'sapador' already exists and is not an empty directory.
  [ Babel evaluation exited with code 128 ]
  :end:


** Prototipagem

- Site de exemplos de jogos
  https://www.kenney.nl



        args:
        - -xec
        - |
        sed -i "s|'port' => 3306,|'port' => '3306',|g" /opt/bitnami/drupal/sites/default/settings.php
        /opt/bitnami/scripts/drupal/entrypoint.sh /opt/bitnami/scripts/apache/run.sh
        sleep 9000

        command:
        - /bin/bash
